**Módulo 4 - Trabajando con data en Python**

**Leyendo archivos**

In [16]:
file1 = open("text.csv")

file1.name

'text.csv'

In [13]:
file1.mode

'r'

In [14]:
with open ("text.csv") as file1:
    
    file_stuff = file1.read() #imprime cada línea del archivo
    print(file_stuff)
    
print(file1.closed) #Archivo cerrado. Ya no puede ser accesado
print(file_stuff) #Pero si se puede usar la información que fue leída en una variable

a,b,c
1,2,3
4,5,6
7,8,9
True
a,b,c
1,2,3
4,5,6
7,8,9

In [17]:
file1 = open("text.csv")
file_stuff = file1.readlines()
print(file_stuff)

['a,b,c\n', '1,2,3\n', '4,5,6\n', '7,8,9']

In [18]:
with open ("text.csv") as file1:
    
    file_stuff = file1.readline() #imprime la primera línea
    print(file_stuff)
    file_stuff = file1.readline() #imprime la segunda línea
    print(file_stuff)

a,b,c

1,2,3

True

**Escribiendo a un archivo**

In [21]:
with open ("text.csv", 'w') as file1: #El método 'w' reescribe el archivo
    
    file1.write('1,2,3\n') #Escribe una línea en el archivo. Si se quierne escribir varias líneas, puede usarse un for loop

In [22]:
with open ("text.csv", 'a') as file1: #El método 'a' agrega una línea al archivo existente
    
    file1.write('4,5,6\n') #Escr

**Trabajando con Pandas**

In [23]:
import pandas as pd

In [24]:
df= pd.read_csv('text.csv') #Leyendo un archivo con pandas
df.head()

   1  2  3
0  4  5  6

In [34]:
songs = {
    'Artist': ['Michael Jackson', 'AC/DC'],
    'Album': ['Thriller', 'Back in black'],
    'Released': ['1982', '1980']
}

df = pd.DataFrame(songs) #Creando un dataframe desde un dictionary
df.head()

            Artist          Album Released
0  Michael Jackson       Thriller     1982
1            AC/DC  Back in black     1980

In [27]:
df[['Artist']] #Un nuevo dataframe solo de la columna artist

            Artist
0  Michael Jackson
1            AC/DC

In [39]:
#df.ix[0,0] - Este código ya no es válido. Debe usarse iloc o loc

df.iloc[0,0] #primera fila, primera columna

'Michael Jackson'

In [38]:
df.loc[0, 'Artist'] #Primera fila, primera columna

'Michael Jackson'

**Trabajando con datos en pandas**

In [37]:
df['Artist'].unique()

array(['Michael Jackson', 'AC/DC'], dtype=object)

In [36]:
df1 = df[df['Released'] == '1980']
df1

  Artist          Album Released
1  AC/DC  Back in black     1980

**Pandas Practice Lab**

Utilizar pandas para crear el siguiente dataframe:

<center>
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%204/images/Student_data.png" width="300" alt="Student Data"  />
</center>

In [44]:
students = {
    'Student': ['David', 'Samuel', 'Terry', 'Evan'],
    'Age': [27, 24, 22, 32],
    'Course': ['Python', 'Data Structures', 'Machine Learning', 'Web Development'],
    'Country': ['UK', 'Canada', 'China', 'USA'],
    'Marks': [85, 72, 89, 76]
}

In [46]:
df = pd.DataFrame(students)
df

  Student  Age            Course Country  Marks
0   David   27            Python      UK     85
1  Samuel   24   Data Structures  Canada     72
2   Terry   22  Machine Learning   China     89
3    Evan   32   Web Development     USA     76

**Problema 2: Extraer la columna 'Marks'**

In [42]:
b = df[['Marks']]
b

   Marks
0     85
1     72
2     89
3     76

**Extraer las columnas 'Course' y 'Country'**

In [47]:
c = df[['Course', 'Country']]
c

             Course Country
0            Python      UK
1   Data Structures  Canada
2  Machine Learning   China
3   Web Development     USA

**Ejercicio 2**

In [48]:
#Define a dictionary 'x'

x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}

#casting the dictionary to a DataFrame
df = pd.DataFrame(x)

#display the result df
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [49]:
df2=df
df2=df2.set_index("Name")

In [50]:
df2.head()

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

**Extraer el departamento de Jane**

In [52]:
df2.loc['Jane', 'Department']

'Design Team'

**Extraer el salario de Mary**

In [53]:
df2.iloc[3,2]

60000

**Ejercicio 3: Slicing**

In [54]:
df.loc[2:3,'Name':'Department']

   Name  ID      Department
2  Jane   3     Design Team
3  Mary   4  Infrastructure